In [1]:
import pandas as pd

In [2]:
df=pd.read_excel('/home/soniya/Documents/Olympic 2012 Medal Tally.xlsx',header=[0,1])

In [3]:
df

  Unnamed: 0_level_0            Country       Country Code               Year  \
  Unnamed: 0_level_1 Unnamed: 1_level_1 Unnamed: 2_level_1 Unnamed: 3_level_1
0                NaN      Great Britain                GBR               2012
1                NaN             China                 CHN               2012
2                NaN             Russia                RUS               2012
3                NaN      United States                 US               2012
4                NaN              Korea                KOR               2012
5                NaN              Japan                JPN               2012
6                NaN            Germany                GER               2012

  Medal Tally
         Gold Silver Bronze
0          29     17     19
1          38     28     22
2          24     25     32
3          46     28     29
4          13      8      7
5           7     14     17
6          11     11     14

In [4]:
df.describe()

      Unnamed: 0_level_0               Year Medal Tally
      Unnamed: 0_level_1 Unnamed: 3_level_1        Gold     Silver     Bronze
count                0.0                7.0    7.000000   7.000000   7.000000
mean                 NaN             2012.0   24.000000  18.714286  20.000000
std                  NaN                0.0   14.628739   8.280787   8.602325
min                  NaN             2012.0    7.000000   8.000000   7.000000
25%                  NaN             2012.0   12.000000  12.500000  15.500000
50%                  NaN             2012.0   24.000000  17.000000  19.000000
75%                  NaN             2012.0   33.500000  26.500000  25.500000
max                  NaN             2012.0   46.000000  28.000000  32.000000

In [5]:
df.Year

   Unnamed: 3_level_1
0                2012
1                2012
2                2012
3                2012
4                2012
5                2012
6                2012

In [6]:
#df.loc[['Country'],['Medal Tally']['Gold']]

In [7]:
df1=df['Medal Tally']
df1

   Gold  Silver  Bronze
0    29      17      19
1    38      28      22
2    24      25      32
3    46      28      29
4    13       8       7
5     7      14      17
6    11      11      14

In [8]:
Gold=df1['Gold']
df['Gold']=Gold
df[['Country','Gold']]

             Country Gold
  Unnamed: 1_level_1
0      Great Britain   29
1             China    38
2             Russia   24
3      United States   46
4              Korea   13
5              Japan    7
6            Germany   11

In [9]:
df1.max()

Gold      46
Silver    28
Bronze    32
dtype: int64

In [10]:
df.max()

Unnamed: 0_level_0  Unnamed: 0_level_1              NaN
Country             Unnamed: 1_level_1    United States
Country Code        Unnamed: 2_level_1               US
Year                Unnamed: 3_level_1             2012
Medal Tally         Gold                             46
                    Silver                           28
                    Bronze                           32
Gold                                                 46
dtype: object

In [11]:
df1.idxmax()

Gold      3
Silver    1
Bronze    2
dtype: int64

In [12]:
df2=(c)

NameError: name 'c' is not defined

In [13]:
df2

NameError: name 'df2' is not defined

In [14]:
df2.max()

NameError: name 'df2' is not defined

In [15]:
df1.iloc[:,0].max()

46

In [16]:
df[['Country','Medal Tally']]

             Country Medal Tally
  Unnamed: 1_level_1        Gold Silver Bronze
0      Great Britain          29     17     19
1             China           38     28     22
2             Russia          24     25     32
3      United States          46     28     29
4              Korea          13      8      7
5              Japan           7     14     17
6            Germany          11     11     14

In [17]:
df1['Gold'].max()

46

In [18]:
df1['Gold'].idxmax()

3

In [19]:
df.iloc[3,:2]

Unnamed: 0_level_0  Unnamed: 0_level_1              NaN
Country             Unnamed: 1_level_1    United States
Name: 3, dtype: object

In [20]:
df1.drop(['Silver','Bronze'],axis=1)

   Gold
0    29
1    38
2    24
3    46
4    13
5     7
6    11

In [21]:
df.pop('Country')

  Unnamed: 1_level_1
0      Great Britain
1             China
2             Russia
3      United States
4              Korea
5              Japan
6            Germany

In [22]:
df[['Country','Medal Tally']]

  Medal Tally
         Gold Silver Bronze
0          29     17     19
1          38     28     22
2          24     25     32
3          46     28     29
4          13      8      7
5           7     14     17
6          11     11     14